In [1]:
import pandas as pd
import numpy as np

train_X = pd.read_csv('data/train.csv')
test_X = pd.read_csv('data/test.csv')

train_X.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Null Data check

In [2]:
columns = train_X.columns
for column in columns:
    null_check= train_X[column].isnull().sum()/train_X[column].shape[0]
    print(column, null_check)

PassengerId 0.0
Survived 0.0
Pclass 0.0
Name 0.0
Sex 0.0
Age 0.19865319865319866
SibSp 0.0
Parch 0.0
Ticket 0.0
Fare 0.0
Cabin 0.7710437710437711
Embarked 0.002244668911335578

In [3]:
train_X["Embarked"].fillna('S',inplace=True)
train_X["Embarked"].isnull().sum()

0

## categorize age by dividing 10 year

In [5]:
def category_age(x):
    if x < 10:
        return 0
    elif x < 20:
        return 1
    elif x< 30:
        return 2
    elif x < 40:
        return 3
    elif x< 50:
        return 4
    elif x < 60:
        return 5
    elif x< 70:
        return 6
    else:
        return 7

In [6]:
train_X["Age_category"]=train_X["Age"].apply(category_age)
test_X["Age_category"] = test_X["Age"].apply(category_age)

### change string to categorical data (각 피쳐들을 수치로 바꿈)

In [7]:
# Embarked Feature

train_X["Embarked"] = train_X["Embarked"].map({'C':0, 'Q':1,'S':2})
test_X["Embarked"] = test_X["Embarked"].map({'C':0, 'Q':1,'S':2})

In [8]:
# Sex Feature
train_X["Sex"] = train_X["Sex"].map({'male':1, 'female':0})
test_X["Sex"] = test_X["Sex"].map({'male':1, 'female':0})

### one hot encoding

In [9]:
train_embarked= pd.get_dummies(train_X["Embarked"], prefix="Embarked")
train_X = pd.concat([train_X, train_embarked], axis = 1)

test_embarked= pd.get_dummies(test_X["Embarked"], prefix="Embarked")
test_X = pd.concat([test_X, test_embarked], axis = 1)

In [10]:
train_X.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_category,Embarked_0,Embarked_1,Embarked_2
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2,2,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0,3,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2,2,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2,3,0,0,1
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2,3,0,0,1